---
kind: property
id: P:Autodesk.Revit.DB.Electrical.WireTypeSet.Size
source: html/3ec5c5dc-23de-38d4-fe68-527bfcab311a.htm
---
# Autodesk.Revit.DB.Electrical.WireTypeSet.Size Property

Returns the number of wire types that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```